Тема: Введение в Java: переменные, типы данных, ввод/вывод, операторы.
Файл: Lesson01Basics.java

Теория:

Что такое JVM, JRE, JDK.

Структура программы на Java (class, main, фигурные скобки).

Типы данных: int, double, boolean, char, String.

Арифметика и конкатенация строк.

Ввод через Scanner, вывод через System.out.println.

Домашняя работа (примерный набор):

Написать программу, которая выводит “Hello, Java!”

Считать имя пользователя и вывести “Привет, <имя>”.

Запросить два числа, вывести их сумму.

Посчитать среднее арифметическое трёх чисел.

Определить, чётное ли число.

Перевести градусы Цельсия в Фаренгейты.

Посчитать площадь круга по радиусу.

Определить возраст собаки в “человеческих годах”.

Найти остаток от деления.

Рассчитать стоимость покупки со скидкой 10%.
11–15. (более творческие — например, мини-калькулятор с выбором операций).

Контрольная работа №1:

Реализовать консольный калькулятор:

поддерживает 4 операции (+, -, *, /);

вводит два числа и знак операции;

проверяет деление на ноль;

форматирует вывод красиво.